spec/cassettes/wsfe/wsaa.yml

---
http_interactions:
- request:
    method: get
    uri: https://wsaahomo.afip.gov.ar/ws/services/LoginCms?wsdl
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - text/xml;charset=utf-8
      Vary:
      - Accept-Encoding
      Accept-Ranges:
      - bytes
      Connection:
      - Keep-Alive
      Date:
      - Sat, 02 Mar 2024 21:53:10 GMT
      Age:
      - '3522'
      Content-Length:
      - '917'
      Set-Cookie:
      - f5avraaaaaaaaaaaaaaaa_session_=GMOJKFHMLLGBKHCHKENGGNFPHMNGLODDCMJJPAHEKFIIEDEMHIDDGFHCCKAMLEHDGKHDBAPMLPOAPPOKENAAKIEBHJJGPANBMGJLHAABFIJKLNDFDHLKMDNPNNLIBCMA;
        HttpOnly; secure
    body:
      encoding: ASCII-8BIT
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <wsdl:definitions targetNamespace="https://wsaahomo.afip.gov.ar/ws/services/LoginCms" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:impl="https://wsaahomo.afip.gov.ar/ws/services/LoginCms" xmlns:intf="https://wsaahomo.afip.gov.ar/ws/services/LoginCms" xmlns:tns1="http://wsaa.view.sua.dvadac.desein.afip.gov" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
        <!--WSDL created by Apache Axis version: 1.4
        Built on Apr 22, 2006 (06:55:48 PDT)-->
         <wsdl:types>
          <schema elementFormDefault="qualified" targetNamespace="http://wsaa.view.sua.dvadac.desein.afip.gov" xmlns="http://www.w3.org/2001/XMLSchema">
           <import namespace="https://wsaahomo.afip.gov.ar/ws/services/LoginCms"/>
           <element name="loginCms">
            <complexType>
             <sequence>
              <element name="in0" type="xsd:string"/>
             </sequence>
            </complexType>
           </element>
           <element name="loginCmsResponse">
            <complexType>
             <sequence>
              <element name="loginCmsReturn" type="xsd:string"/>
             </sequence>
            </complexType>
           </element>
          </schema>
          <schema elementFormDefault="qualified" targetNamespace="https://wsaahomo.afip.gov.ar/ws/services/LoginCms" xmlns="http://www.w3.org/2001/XMLSchema">
           <complexType name="LoginFault">
            <sequence/>
           </complexType>
           <element name="fault" type="impl:LoginFault"/>
          </schema>
         </wsdl:types>

           <wsdl:message name="loginCmsRequest">

              <wsdl:part element="tns1:loginCms" name="parameters">

              </wsdl:part>

           </wsdl:message>

           <wsdl:message name="LoginFault">

              <wsdl:part element="impl:fault" name="fault">

              </wsdl:part>

           </wsdl:message>

           <wsdl:message name="loginCmsResponse">

              <wsdl:part element="tns1:loginCmsResponse" name="parameters">

              </wsdl:part>

           </wsdl:message>

           <wsdl:portType name="LoginCMS">

              <wsdl:operation name="loginCms">

                 <wsdl:input message="impl:loginCmsRequest" name="loginCmsRequest">

               </wsdl:input>

                 <wsdl:output message="impl:loginCmsResponse" name="loginCmsResponse">

               </wsdl:output>

                 <wsdl:fault message="impl:LoginFault" name="LoginFault">

               </wsdl:fault>

              </wsdl:operation>

           </wsdl:portType>

           <wsdl:binding name="LoginCmsSoapBinding" type="impl:LoginCMS">

              <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>

              <wsdl:operation name="loginCms">

                 <wsdlsoap:operation soapAction=""/>

                 <wsdl:input name="loginCmsRequest">

                    <wsdlsoap:body use="literal"/>

                 </wsdl:input>

                 <wsdl:output name="loginCmsResponse">

                    <wsdlsoap:body use="literal"/>

                 </wsdl:output>

                 <wsdl:fault name="LoginFault">

                    <wsdlsoap:fault name="LoginFault" use="literal"/>

                 </wsdl:fault>

              </wsdl:operation>

           </wsdl:binding>

           <wsdl:service name="LoginCMSService">

              <wsdl:port binding="impl:LoginCmsSoapBinding" name="LoginCms">

                 <wsdlsoap:address location="https://wsaahomo.afip.gov.ar/ws/services/LoginCms"/>

              </wsdl:port>

           </wsdl:service>

        </wsdl:definitions>
  recorded_at: Sat, 02 Mar 2024 21:53:10 GMT
- request:
    method: post
    uri: https://wsaahomo.afip.gov.ar/ws/services/LoginCms
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns1="https://wsaahomo.afip.gov.ar/ws/services/LoginCms" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://wsaa.view.sua.dvadac.desein.afip.gov"><env:Body><ins0:loginCms><ins0:in0>MIIHJQYJKoZIhvcNAQcCoIIHFjCCBxICAQExDzANBglghkgBZQMEAgEFADCCAU0G
        CSqGSIb3DQEHAaCCAT4EggE6PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0i
        VVRGLTgiPz4NCjxsb2dpblRpY2tldFJlcXVlc3QgdmVyc2lvbj0iMSI+DQogIDxo
        ZWFkZXI+DQogICAgPHVuaXF1ZUlkPjE3MDk0MTYzOTA8L3VuaXF1ZUlkPg0KICAg
        IDxnZW5lcmF0aW9uVGltZT4yMDI0LTAzLTAyVDEzOjE5OjUwLTAzOjAwPC9nZW5l
        cmF0aW9uVGltZT4NCiAgICA8ZXhwaXJhdGlvblRpbWU+MjAyNC0wMy0wM1QwMDoy
        NjozMC0wMzowMDwvZXhwaXJhdGlvblRpbWU+DQogIDwvaGVhZGVyPg0KICA8c2Vy
        dmljZT53c2ZlPC9zZXJ2aWNlPg0KPC9sb2dpblRpY2tldFJlcXVlc3Q+DQqgggNP
        MIIDSzCCAjOgAwIBAgIIfIKLoqIJrRIwDQYJKoZIhvcNAQENBQAwODEaMBgGA1UE
        AwwRQ29tcHV0YWRvcmVzIFRlc3QxDTALBgNVBAoMBEFGSVAxCzAJBgNVBAYTAkFS
        MB4XDTI0MDMwMjIxNDAwOVoXDTI2MDMwMjIxNDAwOVowMTEUMBIGA1UEAwwLcHJv
        Z3JhbWFuZG8xGTAXBgNVBAUTEENVSVQgMjAzNTE0MDQ0NzgwggEiMA0GCSqGSIb3
        DQEBAQUAA4IBDwAwggEKAoIBAQDRjzXdVj1pECeboaxyK3cUC8tZmXysP0ZY6VLe
        WwNddxxii2s3vJksxHeQbOc0Yot0COV/xaOXR72i/GxcuPFsJrxdrXvWQ9SX6hDy
        6bwYrZteSQe/tlMg27YJW/GM63YkL69rV/LIbylFfkZORpZBo5tdcsEik/pFxTbt
        hhORn8gdfhlkkhsp1qqGmrHEVukKVaiUDdc7KyBph08C6g9a/YXfQw3MTT8Lnfl+
        da+5l9Kke/t55NWXskDbj/8KSsxU1BOJMu8f990rA8AZ8JKDE6I6sknfa64hJyQG
        J8Pb+BLzMhqr0uyYqQKb7AIm6BJLbR9ETSEYLxX782HiyCGvAgMBAAGjYDBeMAwG
        A1UdEwEB/wQCMAAwHwYDVR0jBBgwFoAUs7LT//3put7eja8RIZzWIH3yT28wHQYD
        VR0OBBYEFL3jRcq61lMPHKT0lnm7uUZC41D9MA4GA1UdDwEB/wQEAwIF4DANBgkq
        hkiG9w0BAQ0FAAOCAQEAQioN7B++wbU9fUEXdDa4Lxg6PivMwLJQ1/wjgdT4ZnK4
        t4VxHNTu6lg9C4hEyavi+cWLxcOI5Op7/x+6dC2YC2v5Q/1Ni4VSLi5wInZlNKZD
        oCarJMgEAGhmmJeNQGJaN1WpLpdE6iiRk/Hi9WYWGNL24UGyX1EiEqvatgx0XXXP
        rvdWLUAueUigfI4Z1pFYHtar29JkaKMydmHey/BJlUDrnnNy3uIi03x/da5xPaAt
        s0H37/FN0my7Cu4qKfUmicBciRIz01lwqqN1bzaBuvBxRSupTqOW8Y6PzuFW+8LW
        sCpenlPcmQ3zvHjygMij1qa1WhROSh0e6Aj+1sDVCzGCAlYwggJSAgEBMEQwODEa
        MBgGA1UEAwwRQ29tcHV0YWRvcmVzIFRlc3QxDTALBgNVBAoMBEFGSVAxCzAJBgNV
        BAYTAkFSAgh8gouiogmtEjANBglghkgBZQMEAgEFAKCB5DAYBgkqhkiG9w0BCQMx
        CwYJKoZIhvcNAQcBMBwGCSqGSIb3DQEJBTEPFw0yNDAzMDIyMTUzMTBaMC8GCSqG
        SIb3DQEJBDEiBCBMlTRvremt2ivz0vgeqig13a8fv4bDos+1hcgZFW7sHjB5Bgkq
        hkiG9w0BCQ8xbDBqMAsGCWCGSAFlAwQBKjALBglghkgBZQMEARYwCwYJYIZIAWUD
        BAECMAoGCCqGSIb3DQMHMA4GCCqGSIb3DQMCAgIAgDANBggqhkiG9w0DAgIBQDAH
        BgUrDgMCBzANBggqhkiG9w0DAgIBKDANBgkqhkiG9w0BAQEFAASCAQAy7O291wwS
        2SLrUpPtKyISsxsnPuBK7WyCsPfy8G9PsSbwcHXFh6hrxFuEacqNASLtzWc0ZvxY
        g6nJb7V2QFMwIC0GhkFgBxze1LIHKsIuqRDsT3rlz7lTShkI6Fu+XdaZlJx5TM8t
        9AarbOIOB4HEuI/DoZm565IS/5hvt3A3JV+d/pxcE6toLcKEL7xySXQlvvkdPJkw
        ghXzbqvymUwDZU5bUvuS7oTtZehz8Ukag3VKXOiOiHTFnEkc/W+4CXRwp2OsAsUU
        KUpg9f4mlCktiDBSWhCK9cU43vi+uumI26PNsuEyhLSiFmkpoo/epqNmnS9tWOWa
        rdebeHQtV7aY
        </ins0:in0></ins0:loginCms></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"loginCms"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '2896'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sat, 02 Mar 2024 21:53:10 GMT
      Content-Type:
      - text/xml;charset=utf-8
      Set-Cookie:
      - TS01b14f84=0145b27a970df7da03bdf2872dbc24ea1e958c3ad80de953f3b1641a78c7e9b56cf9d0cdb918ee80da67e369e29e9476c6f885dd09d0461bbd0e2a7d3d20db1966ebfbcd6c;
        Path=/
      - f5avraaaaaaaaaaaaaaaa_session_=FNJOMHICCMOFLEJBMJEHPJMNKHBNFAHAPGCNKGIBPCLPNNOEDMCHALCCIEADOOGAMGBDLGCOLPALHMMANGCAOMAIHJIPNHHACCCMIKNHNJGKGFKGKMOKHAMAENEDMLOA;
        HttpOnly; secure
      Vary:
      - Accept-Encoding
      Transfer-Encoding:
      - chunked
    body:
      encoding: ASCII-8BIT
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><loginCmsResponse xmlns="http://wsaa.view.sua.dvadac.desein.afip.gov"><loginCmsReturn>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; standalone=&quot;yes&quot;?&gt;
        &lt;loginTicketResponse version=&quot;1.0&quot;&gt;
            &lt;header&gt;
                &lt;source&gt;CN=wsaahomo, O=AFIP, C=AR, SERIALNUMBER=CUIT 33693450239&lt;/source&gt;
                &lt;destination&gt;SERIALNUMBER=CUIT 20351404478, CN=programando&lt;/destination&gt;
                &lt;uniqueId&gt;285803612&lt;/uniqueId&gt;
                &lt;generationTime&gt;2024-03-02T18:53:10.783-03:00&lt;/generationTime&gt;
                &lt;expirationTime&gt;2024-03-03T06:53:10.783-03:00&lt;/expirationTime&gt;
            &lt;/header&gt;
            &lt;credentials&gt;
                &lt;token&gt;PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgZHN0PSJDTj13c2ZlLCBPPUFGSVAsIEM9QVIiIHVuaXF1ZV9pZD0iMzQ5NTE3MTcxOSIgZ2VuX3RpbWU9IjE3MDk0MTYzMzAiIGV4cF90aW1lPSIxNzA5NDU5NTkwIi8+CiAgICA8b3BlcmF0aW9uIHR5cGU9ImxvZ2luIiB2YWx1ZT0iZ3JhbnRlZCI+CiAgICAgICAgPGxvZ2luIGVudGl0eT0iMzM2OTM0NTAyMzkiIHNlcnZpY2U9IndzZmUiIHVpZD0iU0VSSUFMTlVNQkVSPUNVSVQgMjAzNTE0MDQ0NzgsIENOPXByb2dyYW1hbmRvIiBhdXRobWV0aG9kPSJjbXMiIHJlZ21ldGhvZD0iMjIiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIGtleT0iMjAzNTE0MDQ0NzgiIHJlbHR5cGU9IjQiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmF0aW9uPgo8L3Nzbz4K&lt;/token&gt;
                &lt;sign&gt;elj/lCfdgbw8wjFhD3Zxyg5QMZcjjMFiCTEzLJaAFOsMQl5HmLulgGC1rJX6yAa3pqnZBSHmMJdOZJEHs/D4CmyIiLF81cW3sXLgnI7Fk21uP1nTh4B9NzcDsk8yCdZ4VWEGITYFNTYUkvt7qGvq6jmDtApHuPJOoWWy7z87R90=&lt;/sign&gt;
            &lt;/credentials&gt;
        &lt;/loginTicketResponse&gt;
        </loginCmsReturn></loginCmsResponse></soapenv:Body></soapenv:Envelope>
  recorded_at: Sat, 02 Mar 2024 21:53:10 GMT
recorded_with: VCR 6.0.0
